AerospaceNU/stm32-avionics/stm32_projects/ble_p2p_server/STM32_WPAN/App/app_ble.c
/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx(void *p_Payload);
static void BLE_StatusNot(HCI_TL_CmdStatus_t Status);
static void Ble_Tl_Init(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t *BleGetBdAddress(void);
static void Adv_Request(APP_BLE_ConnStatus_t NewStatus);
static void Adv_Cancel(void);
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
static void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle);
static void Connection_Interval_Update_Req(void);
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

/* USER CODE BEGIN PFP */
static void LinkConfiguration(void);  //[JT]
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/
extern RNG_HandleTypeDef hrng;

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void) {
  SHCI_CmdStatus_t status;
#if (RADIO_ACTIVITY_EVENT != 0)
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
#endif /* RADIO_ACTIVITY_EVENT != 0 */
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet = {
      {{0, 0, 0}}, /**< Header unused */
      {0,          /** pBleBufferAddress not used */
       0,          /** BleBufferSize not used */
       CFG_BLE_NUM_GATT_ATTRIBUTES,
       CFG_BLE_NUM_GATT_SERVICES,
       CFG_BLE_ATT_VALUE_ARRAY_SIZE,
       CFG_BLE_NUM_LINK,
       CFG_BLE_DATA_LENGTH_EXTENSION,
       CFG_BLE_PREPARE_WRITE_LIST_SIZE,
       CFG_BLE_MBLOCK_COUNT,
       CFG_BLE_MAX_ATT_MTU,
       CFG_BLE_SLAVE_SCA,
       CFG_BLE_MASTER_SCA,
       CFG_BLE_LS_SOURCE,
       CFG_BLE_MAX_CONN_EVENT_LENGTH,
       CFG_BLE_HSE_STARTUP_TIME,
       CFG_BLE_VITERBI_MODE,
       CFG_BLE_OPTIONS,
       0,
       CFG_BLE_MAX_COC_INITIATOR_NBR,
       CFG_BLE_MIN_TX_POWER,
       CFG_BLE_MAX_TX_POWER,
       CFG_BLE_RX_MODEL_CONFIG,
       CFG_BLE_MAX_ADV_SET_NBR,
       CFG_BLE_MAX_ADV_DATA_LEN,
       CFG_BLE_TX_PATH_COMPENS,
       CFG_BLE_RX_PATH_COMPENS,
       CFG_BLE_CORE_VERSION,
       CFG_BLE_OPTIONS_EXT}};

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init();

#if (CFG_LPM_STANDBY_SUPPORTED == 0)
  UTIL_LPM_SetOffMode(1U << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);
#endif /* CFG_LPM_STANDBY_SUPPORTED == 0 */

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU,
                   hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
  if (status != SHCI_Success) {
    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r",
                status);
    /* if you are here, maybe CPU2 doesn't contain
     * STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
    Error_Handler();
  } else {
    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
  }

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

  /**
   * From here, all initialization are BLE application specific
   */

  UTIL_SEQ_RegTask(1 << CFG_TASK_ADV_CANCEL_ID, UTIL_SEQ_RFU, Adv_Cancel);

  /* USER CODE BEGIN APP_BLE_Init_4 */

  /* USER CODE END APP_BLE_Init_4 */

  /**
   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
   */
#if (RADIO_ACTIVITY_EVENT != 0)
  ret = aci_hal_set_radio_activity_mask(0x0006);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG(
        "  Fail   : aci_hal_set_radio_activity_mask command, result: 0x%x \n\r",
        ret);
  } else {
    APP_DBG_MSG("  Success: aci_hal_set_radio_activity_mask command\n\r");
  }
#endif /* RADIO_ACTIVITY_EVENT != 0 */

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
  index_con_int = 0;
  mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */

  /**
   * Initialize Custom Template Application
   */
  Custom_APP_Init();

  /* USER CODE BEGIN APP_BLE_Init_3 */
  //[JT]
  UTIL_SEQ_RegTask(1 << CFG_TASK_LINK_CONFIG_ID, UTIL_SEQ_RFU,
                   LinkConfiguration);
  /* USER CODE END APP_BLE_Init_3 */

  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;

  /**
   * Start to Advertise to be connected by a Client
   */
  Adv_Request(APP_BLE_FAST_ADV);

  /* USER CODE BEGIN APP_BLE_Init_2 */

  /* USER CODE END APP_BLE_Init_2 */

  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt) {
  hci_event_pckt *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci *p_blecore_evt;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  hci_le_connection_complete_event_rp0 *p_connection_complete_event;
  hci_disconnection_complete_event_rp0 *p_disconnection_complete_event;
#if (CFG_DEBUG_APP_TRACE != 0)
  hci_le_connection_update_complete_event_rp0
      *p_connection_update_complete_event;
#endif /* CFG_DEBUG_APP_TRACE != 0 */

  /* PAIRING */
  aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
  /* PAIRING */

  /* USER CODE BEGIN SVCCTL_App_Notification */

  /* USER CODE END SVCCTL_App_Notification */

  p_event_pckt = (hci_event_pckt *)((hci_uart_pckt *)p_Pckt)->data;

  switch (p_event_pckt->evt) {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE: {
      p_disconnection_complete_event =
          (hci_disconnection_complete_event_rp0 *)p_event_pckt->data;

      if (p_disconnection_complete_event->Connection_Handle ==
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle) {
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
        APP_DBG_MSG(">>== HCI_DISCONNECTION_COMPLETE_EVT_CODE\n");
        APP_DBG_MSG(
            "     - Connection Handle:   0x%x\n     - Reason:    0x%x\n\r",
            p_disconnection_complete_event->Connection_Handle,
            p_disconnection_complete_event->Reason);

        /* USER CODE BEGIN EVT_DISCONN_COMPLETE_2 */

