AerospaceNU/stm32-avionics/stm32_projects/ble_p2p_server/STM32_WPAN/App/app_ble.c
  ret = aci_hal_write_config_data(CONFIG_DATA_RANDOM_ADDRESS_OFFSET,
                                  CONFIG_DATA_RANDOM_ADDRESS_LEN,
                                  (uint8_t *)a_srd_bd_addr);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG(
        "  Fail   : aci_hal_write_config_data command - "
        "CONFIG_DATA_RANDOM_ADDRESS_OFFSET, result: 0x%x \n",
        ret);
  } else {
    APP_DBG_MSG(
        "  Success: aci_hal_write_config_data command - "
        "CONFIG_DATA_RANDOM_ADDRESS_OFFSET\n");
    APP_DBG_MSG("  Random Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",
                (uint8_t)(a_srd_bd_addr[1] >> 8), (uint8_t)(a_srd_bd_addr[1]),
                (uint8_t)(a_srd_bd_addr[0] >> 24),
                (uint8_t)(a_srd_bd_addr[0] >> 16),
                (uint8_t)(a_srd_bd_addr[0] >> 8), (uint8_t)(a_srd_bd_addr[0]));
  }
#endif /* CFG_BLE_ADDRESS_TYPE != GAP_PUBLIC_ADDR */

  /**
   * Write Identity root key used to derive LTK and CSRK
   */
  ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN,
                                  (uint8_t *)a_BLE_CfgIrValue);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG(
        "  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, "
        "result: 0x%x \n",
        ret);
  } else {
    APP_DBG_MSG(
        "  Success: aci_hal_write_config_data command - "
        "CONFIG_DATA_IR_OFFSET\n");
  }

  /**
   * Write Encryption root key used to derive LTK and CSRK
   */
  ret = aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET, CONFIG_DATA_ER_LEN,
                                  (uint8_t *)a_BLE_CfgErValue);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG(
        "  Fail   : aci_hal_write_config_data command - CONFIG_DATA_ER_OFFSET, "
        "result: 0x%x \n",
        ret);
  } else {
    APP_DBG_MSG(
        "  Success: aci_hal_write_config_data command - "
        "CONFIG_DATA_ER_OFFSET\n");
  }

  /**
   * Set TX Power.
   */
  ret = aci_hal_set_tx_power_level(1, CFG_TX_POWER);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG(
        "  Fail   : aci_hal_set_tx_power_level command, result: 0x%x \n", ret);
  } else {
    APP_DBG_MSG("  Success: aci_hal_set_tx_power_level command\n");
  }

  /**
   * Initialize GATT interface
   */
  ret = aci_gatt_init();
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("  Fail   : aci_gatt_init command, result: 0x%x \n", ret);
  } else {
    APP_DBG_MSG("  Success: aci_gatt_init command\n");
  }

  /**
   * Initialize GAP interface
   */
  role = 0;

#if (BLE_CFG_PERIPHERAL == 1)
  role |= GAP_PERIPHERAL_ROLE;
#endif /* BLE_CFG_PERIPHERAL == 1 */

#if (BLE_CFG_CENTRAL == 1)
  role |= GAP_CENTRAL_ROLE;
#endif /* BLE_CFG_CENTRAL == 1 */

  /* USER CODE BEGIN Role_Mngt*/

  /* USER CODE END Role_Mngt */

  if (role > 0) {
    const char *name = CFG_GAP_DEVICE_NAME;
    ret = aci_gap_init(role, CFG_PRIVACY, CFG_GAP_DEVICE_NAME_LENGTH,
                       &gap_service_handle, &gap_dev_name_char_handle,
                       &gap_appearance_char_handle);

    if (ret != BLE_STATUS_SUCCESS) {
      APP_DBG_MSG("  Fail   : aci_gap_init command, result: 0x%x \n", ret);
    } else {
      APP_DBG_MSG("  Success: aci_gap_init command\n");
    }

    ret =
        aci_gatt_update_char_value(gap_service_handle, gap_dev_name_char_handle,
                                   0, strlen(name), (uint8_t *)name);
    if (ret != BLE_STATUS_SUCCESS) {
      BLE_DBG_SVCCTL_MSG(
          "  Fail   : aci_gatt_update_char_value - Device Name\n");
    } else {
      BLE_DBG_SVCCTL_MSG(
          "  Success: aci_gatt_update_char_value - Device Name\n");
    }
  }

  ret =
      aci_gatt_update_char_value(gap_service_handle, gap_appearance_char_handle,
                                 0, 2, (uint8_t *)&a_appearance);
  if (ret != BLE_STATUS_SUCCESS) {
    BLE_DBG_SVCCTL_MSG("  Fail   : aci_gatt_update_char_value - Appearance\n");
  } else {
    BLE_DBG_SVCCTL_MSG("  Success: aci_gatt_update_char_value - Appearance\n");
  }

  /**
   * Initialize Default PHY
   */
  ret = hci_le_set_default_phy(ALL_PHYS_PREFERENCE, TX_2M_PREFERRED,
                               RX_2M_PREFERRED);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("  Fail   : hci_le_set_default_phy command, result: 0x%x \n",
                ret);
  } else {
    APP_DBG_MSG("  Success: hci_le_set_default_phy command\n");
  }

  /**
   * Initialize IO capability
   */
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
      .ioCapability = CFG_IO_CAPABILITY;
  ret = aci_gap_set_io_capability(
      BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .ioCapability);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("  Fail   : aci_gap_set_io_capability command, result: 0x%x \n",
                ret);
  } else {
    APP_DBG_MSG("  Success: aci_gap_set_io_capability command\n");
  }

  /**
   * Initialize authentication
   */
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
      .mitm_mode = CFG_MITM_PROTECTION;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
      .encryptionKeySizeMin = CFG_ENCRYPTION_KEY_SIZE_MIN;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
      .encryptionKeySizeMax = CFG_ENCRYPTION_KEY_SIZE_MAX;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
      .Use_Fixed_Pin = CFG_USED_FIXED_PIN;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
      .Fixed_Pin = CFG_FIXED_PIN;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
      .bonding_mode = CFG_BONDING_MODE;
  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init_1*/

  /* USER CODE END Ble_Hci_Gap_Gatt_Init_1*/

  ret = aci_gap_set_authentication_requirement(
      BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .bonding_mode,
      BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .mitm_mode,
      CFG_SC_SUPPORT, CFG_KEYPRESS_NOTIFICATION_SUPPORT,
      BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .encryptionKeySizeMin,
      BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .encryptionKeySizeMax,
      BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .Use_Fixed_Pin,
      BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .Fixed_Pin,
      CFG_IDENTITY_ADDRESS);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG(
        "  Fail   : aci_gap_set_authentication_requirement command, result: "
        "0x%x \n",
        ret);
  } else {
    APP_DBG_MSG("  Success: aci_gap_set_authentication_requirement command\n");
  }

  /**
   * Initialize whitelist
   */
  if (BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam
          .bonding_mode) {
    ret = aci_gap_configure_whitelist();
    if (ret != BLE_STATUS_SUCCESS) {
      APP_DBG_MSG(
          "  Fail   : aci_gap_configure_whitelist command, result: 0x%x \n",
          ret);
    } else {
      APP_DBG_MSG("  Success: aci_gap_configure_whitelist command\n");
    }
  }
  APP_DBG_MSG("==>> End Ble_Hci_Gap_Gatt_Init function\n\r");
}

static void Adv_Request(APP_BLE_ConnStatus_t NewStatus) {
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  BleApplicationContext.Device_Connection_Status = NewStatus;
  /* Start Fast or Low Power Advertising */
  ret = aci_gap_set_discoverable(
      ADV_TYPE, CFG_FAST_CONN_ADV_INTERVAL_MIN, CFG_FAST_CONN_ADV_INTERVAL_MAX,
      CFG_BLE_ADDRESS_TYPE, ADV_FILTER, 0, 0, 0, 0, 0, 0);
  if (ret != BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - fail, result: 0x%x \n", ret);
  } else {
    APP_DBG_MSG("==>> aci_gap_set_discoverable - Success\n");
  }

