AerospaceNU/stm32-avionics/stm32_projects/ble_p2p_server/STM32_WPAN/App/app_ble.c
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

//[JT]
// from
// https://github.com/stm32-hotspot/STM32WB-BLE-Basic-DataThroughput-Server/blob/main/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_Basic_DataThroughput_Server/STM32_WPAN/App/app_ble.c#L862
static void LinkConfiguration(void) {
  tBleStatus status;
  uint8_t TX_PHY, RX_PHY;

  /* Set Data Length */
  APP_DBG_MSG("Set data length \n");
  status = hci_le_set_data_length(
      BleApplicationContext.BleApplicationContext_legacy.connectionHandle, 251,
      2120);
  if (status == BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("HCI_LE_SET_DATA_LENGTH Update, Successfully \n");
  } else {
    APP_DBG_MSG("HCI_LE_SET_DATA_LENGTH Update, Error \n");
  }

  /* Set ATT MTU size */
  APP_DBG_MSG("Request ATT MTU size exchange\n");

  status = aci_gatt_exchange_config(
      BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  if (status == BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("ACI_GATT_EXCHANGE_CONFIG Update, Successfully \n");
  } else {
    APP_DBG_MSG("ACI_GATT_EXCHANGE_CONFIG Update, Error \n");
  }

  // APP_DBG_MSG("GATT_PROC_MTU_UPDATE complete event received \n");

  /* Set Connection Interval */
  APP_DBG_MSG("Set Connection Interval \n");
  //  uint16_t interval_min = CONN_P(30.0);   // optimal for iphone XR
  //  uint16_t interval_max = CONN_P(30.0);
  uint16_t interval_min =
      CONN_P(48.75);  // opimtal for Android Samsung Galaxy S10
  uint16_t interval_max = CONN_P(48.75);
  uint16_t slave_latency = L2CAP_SLAVE_LATENCY;
  uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
  status = aci_l2cap_connection_parameter_update_req(
      BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
      interval_min, interval_max, slave_latency, timeout_multiplier);
  if (status == BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("ACI_L2CAP_CONNECTION_PARAMETER_UPDATE_REQ, Successfully \n\r");
  } else {
    APP_DBG_MSG("ACI_L2CAP_CONNECTION_PARAMETER_UPDATE_REQ, Error \n\r");
  }

  HAL_Delay(1);
  //  UTIL_SEQ_WaitEvt(
  //      1
  //      << CFG_MY_IDLEEVT_CONN_UPDATE_COMPLETE); /* Wait for Connection Update
  //                                                  complete event to be
  //                                                  recieved before proceeding
  //                                                  */

  /* Read PHY config */

  status = hci_le_read_phy(
      BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
      &TX_PHY, &RX_PHY);
  if (status == BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("HCI_LE_READ_PHY, Succesffuly \n");
    APP_DBG_MSG("Current PHY: TX= %d, RX= %d \n", TX_PHY, RX_PHY);
  } else {
    APP_DBG_MSG("HCI_LE_READ_PHY, Error \n");
  }
}

//[JT] - Toggles between the two PHYs
void PHY_Configuration(void) {
  tBleStatus status;
  uint8_t TX_PHY, RX_PHY;

  /* Set PHY config */
  APP_DBG_MSG("Set PHY Config \n");

  status = hci_le_read_phy(
      BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
      &TX_PHY, &RX_PHY);
  if (status == BLE_STATUS_SUCCESS) {
    APP_DBG_MSG("HCI_LE_READ_PHY, Succesffuly \n");
    APP_DBG_MSG("PHY Param  TX= %d, RX= %d \n", TX_PHY, RX_PHY);
    if ((TX_PHY == TX_2M) && (RX_PHY == RX_2M)) {
      APP_DBG_MSG("**TX= %d, **RX= %d \n", TX_1M, RX_1M);
      status = hci_le_set_phy(
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
          ALL_PHYS_PREFERENCE, TX_1M, RX_1M, 0);
    } else {
      APP_DBG_MSG("**TX= %d, **RX= %d \n", TX_2M_PREFERRED, RX_2M_PREFERRED);
      status = hci_le_set_phy(
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
          ALL_PHYS_PREFERENCE, TX_2M_PREFERRED, RX_2M_PREFERRED, 0);
    }
    if (status == BLE_STATUS_SUCCESS) {
      APP_DBG_MSG("HCI_LE_SET_PHY Update, Successfully \n\r");
    } else {
      APP_DBG_MSG("HCI_LE_SET_PHY Update, Failed , status: 0x%X\n\r", status);
    }
  } else {
    APP_DBG_MSG("HCI_LE_READ_PHY, Error \n");
  }
}

/* USER CODE END FD_WRAP_FUNCTIONS */
